#+TITLE: DNS Research
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 25th of March, 2019
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+STARTUP: showeverything

* what do we want

apisnoop.cncf.io => apisnoop.ii.coop
apisnoop.ii.coop => apisnoop.cncf.ci
apisnoop.cncf.ci => production deploy == master 
branch-KEY.apisnoop.cncf.ci => review / staging deploys

* starting place
#+NAME: digging around
#+BEGIN_SRC shell
dig apisnoop.cncf.io \
| grep -v \; \
| grep . # remove blank lines
#+END_SRC

#+RESULTS: digging around
#+BEGIN_EXAMPLE :noeval t
apisnoop.cncf.io.	197	IN	CNAME	apisnoop.ii.coop.
apisnoop.ii.coop.	34	IN	CNAME	apisnoop.cncf.ci.
apisnoop.cncf.ci.	34	IN	CNAME	apisnoop.netlify.com.
apisnoop.netlify.com.	17	IN	A	13.236.188.46
#+END_EXAMPLE

#+NAME: apisnoop.cncf.ci 
#+BEGIN_SRC shell
dig apisnoop.cncf.ci \
| grep -v \; \
| grep .
#+END_SRC

#+RESULTS: apisnoop.cncf.ci
#+BEGIN_EXAMPLE :noeval t
apisnoop.cncf.ci.	23	IN	CNAME	apisnoop.netlify.com.
apisnoop.netlify.com.	6	IN	A	13.236.188.46
#+END_EXAMPLE

#+NAME: random
#+BEGIN_SRC shell
dig foobarbaz.apisnoop.cncf.ci \
| grep -v \; \
| grep .
#+END_SRC

#+RESULTS: random
#+BEGIN_EXAMPLE :noeval t
foobarbaz.apisnoop.cncf.ci. 59	IN	A	35.244.71.53
#+END_EXAMPLE

#+NAME: random apisnoop.ii.coop
#+BEGIN_SRC shell
dig foobar.apisnoop.cncf.io \
| grep -v \; \
| grep .
#+END_SRC

#+RESULTS: random apisnoop.ii.coop
#+BEGIN_EXAMPLE :noeval t
#+END_EXAMPLE

#+BEGIN_SRC shell
whois 35.244.71.53 | grep -v \# | grep .
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
NetRange:       35.208.0.0 - 35.247.255.255
CIDR:           35.240.0.0/13, 35.224.0.0/12, 35.208.0.0/12
NetName:        GOOGLE-CLOUD
NetHandle:      NET-35-208-0-0-1
Parent:         NET35 (NET-35-0-0-0-0)
NetType:        Direct Allocation
OriginAS:       
Organization:   Google LLC (GOOGL-2)
RegDate:        2017-09-29
Updated:        2018-01-24
Comment:        *** The IP addresses under this Org-ID are in use by Google Cloud customers *** 
Comment:        
Comment:        Direct all copyright and legal complaints to 
Comment:        https://support.google.com/legal/go/report
Comment:        
Comment:        Direct all spam and abuse complaints to 
Comment:        https://support.google.com/code/go/gce_abuse_report
Comment:        
Comment:        For fastest response, use the relevant forms above.
Comment:        
Comment:        Complaints can also be sent to the GC Abuse desk 
Comment:        (google-cloud-compliance@google.com) 
Comment:        but may have longer turnaround times.
Ref:            https://rdap.arin.net/registry/ip/35.208.0.0
OrgName:        Google LLC
OrgId:          GOOGL-2
Address:        1600 Amphitheatre Parkway
City:           Mountain View
StateProv:      CA
PostalCode:     94043
Country:        US
RegDate:        2006-09-29
Updated:        2017-12-21
Comment:        *** The IP addresses under this Org-ID are in use by Google Cloud customers *** 
Comment:        
Comment:        Direct all copyright and legal complaints to 
Comment:        https://support.google.com/legal/go/report
Comment:        
Comment:        Direct all spam and abuse complaints to 
Comment:        https://support.google.com/code/go/gce_abuse_report
Comment:        
Comment:        For fastest response, use the relevant forms above.
Comment:        
Comment:        Complaints can also be sent to the GC Abuse desk 
Comment:        (google-cloud-compliance@google.com) 
Comment:        but may have longer turnaround times.
Comment:        
Comment:        Complaints sent to any other POC will be ignored.
Ref:            https://rdap.arin.net/registry/entity/GOOGL-2
OrgTechHandle: ZG39-ARIN
OrgTechName:   Google LLC
OrgTechPhone:  +1-650-253-0000 
OrgTechEmail:  arin-contact@google.com
OrgTechRef:    https://rdap.arin.net/registry/entity/ZG39-ARIN
OrgAbuseHandle: GCABU-ARIN
OrgAbuseName:   GC Abuse
OrgAbusePhone:  +1-650-253-0000 
OrgAbuseEmail:  google-cloud-compliance@google.com
OrgAbuseRef:    https://rdap.arin.net/registry/entity/GCABU-ARIN
OrgNOCHandle: GCABU-ARIN
OrgNOCName:   GC Abuse
OrgNOCPhone:  +1-650-253-0000 
OrgNOCEmail:  google-cloud-compliance@google.com
OrgNOCRef:    https://rdap.arin.net/registry/entity/GCABU-ARIN
#+END_EXAMPLE
